<!-- 3．複雑な条件分岐に対応しよう -->

<?php
/* --------------------------------------------
 * 　複雑な条件分岐
* -------------------------------------------- */
// if〜else
$a = 5;
$b = 3;
if ($a == $b) {
    echo $a . 'と' . $b . 'は同じ値です';
} else {
    echo $a . 'と' . $b . 'の値は異なります';
}

echo '<br>';

// if〜elseif〜else（$a=5、$b=3）
if ($a == $b) {
    echo $a . 'と' . $b . 'は同じ値です';
} elseif ($a > $b) {
    echo $a . 'は' . $b . 'より大きいです';
} else {
    echo $a . 'は' . $b . 'より小さいです';
}

echo '<br>';

// if文の流れを確認（$a=5、$b=3）
if ($a == $b) {
    echo $a . 'と' . $b . 'は同じ値です';
} elseif ($a > $b) {
    echo $a . 'は' . $b . 'より大きいです';
} elseif ($a >= $b) {
    echo $a . 'は' . $b . '以上です';
} else {
    echo $a . 'は' . $b . 'より小さいです';
}
?>
