<!-- テーマ１１　[PHPの基礎] PHPとHTMLの混在 -->

<!-- 1．PHPとHTMLが混在する書き方に慣れよう -->

<?php
/* --------------------------------------------
 * 　PHPとHTMLの混在
 * -------------------------------------------- */
?>

<?php
$a = 5;
$b = 3;
?>
<?php if ($a > $b) { ?>
    <div>
        <ul>
            <li>あああああ</li>
            <li>いいいいい</li>
            <li>ううううう</li>
        </ul>
    </div>
<?php } ?>

<!-- コロン構文の場合 -->
<?php if ($a > $b) : ?>
    <div>
        <ul>
            <li>あああああ</li>
            <li>いいいいい</li>
            <li>ううううう</li>
        </ul>
    </div>
<?php endif; ?>
