<!-- 3．多次元配列の復習とforeach文で各要素を取り出す方法 -->

<?php
/* --------------------------------------------
 * 　多次元配列の復習とforeach文
 * -------------------------------------------- */

$grades_list = [
	'山田' => [
		'数学' => 90,
		'英語' => 82,
		'歴史' => 70
  ],
	'清水' => [
		'数学' => 52,
		'英語' => 62,
		'歴史' => 88
  ],
	'鈴木' => [
		'数学' => 96,
		'英語' => 94,
		'歴史' => 80
  ]
];
/*
$grades_list = [
	'山田' => ['数学' => 90, '英語' => 82, '歴史' => 70],
	'清水' => ['数学' => 52, '英語' => 62, '歴史' => 88],
	'鈴木' => ['数学' => 96, '英語' => 94, '歴史' => 80]
];
*/ 

foreach ($grades_list as $key => $grades) {
	foreach ($grades as $subject => $score)
		echo $key . 'さんの' . $subject . 'スコアは' . $score . '点です<br>';
}
?>
